In [1]:
#Selecting Entries
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#Lets try some Series indexing
ser1 = Series(np.arange(3),index=['A','B','C'])

#multiply all values by 2, to avoid confusion in future
ser1 = 2*ser1

#Show
ser1

A    0
B    2
C    4
dtype: int32

In [3]:
#Can grab entry by index name
ser1['B']

2

In [4]:
#Or grab by index 
ser1[1]

2

In [5]:
#Can also grab by index range
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [6]:
#Or grab range by range of index values
ser1[['A','B','C']]

A    0
B    2
C    4
dtype: int32

In [7]:
#Or grab by logic
ser1[ser1>3]

C    4
dtype: int32

In [8]:
#Can also ser using these methods
ser1[ser1>3] = 10

#Show
ser1

A     0
B     2
C    10
dtype: int32

In [9]:
#Now let's see sleection in a DataFrame

dframe = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'],columns=['A','B','C','D','E'])

#Show
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [10]:
#Select by column name
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [11]:
#Select by multiple columns
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [12]:
#Can also use boolean
dframe[dframe['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [13]:
dframe[dframe['C']>8]['C']

SF     12
DC     17
Chi    22
Name: C, dtype: int32

In [14]:
dframe[dframe['C']>8]['C']=19

C:\Python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [22]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  29  13  14
DC   15  16  29  18  19
Chi  20  21  29  23  24

In [27]:
dframe.loc['DC','C']=np.NaN
dframe

      A   B     C   D   E
NYC   0   1   2.0   3   4
LA    5   6   7.0   8   9
SF   10  11  29.0  13  14
DC   15  16   NaN  18  19
Chi  20  21  29.0  23  24

In [35]:
# 6+np.NaN

nan

In [32]:
dframe.loc['DC','C']=None   #"None is not NaN"

In [33]:
dframe

      A   B     C   D   E
NYC   0   1   2.0   3   4
LA    5   6   7.0   8   9
SF   10  11  29.0  13  14
DC   15  16   NaN  18  19
Chi  20  21  29.0  23  24

### TASK

a=''  #real int
a=None

In [18]:
dframe.loc[['DC','SF','Chi'],'C']=29

In [19]:
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  29  13  14
DC   15  16  29  18  19
Chi  20  21  29  23  24

In [20]:
#Can also just shoe a boolean DataFrame
dframe> 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [21]:
#Can alos use ix as previously discussed to label-index
dframe.ix['LA']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [ ]:
#Another example
dframe.ix[1]

In [ ]:
#Next we'll learn about data alignment!